### Important Imports

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### First Table

In [3]:
students_data = pd.read_excel('datasets/Student Data From Database.xlsx')
students_data.head()

,RegNo,DOAd,FamilyNo,RollNo,StudentName,FatherName,DOB,Cast,ClassName,SecName,FCNIC,BForm,AddFormNo,Religion,FatherNo,MotherNo,Gender,Medium,Address,FeeType
0,F6462,2022-07-27,2351,1,MUHAMMAD UMER,TOUQEER AHMAD,2020-03-10,MUGHAL,PLAY GROUP,JINNAH,35201-8245663-5,NaN,F6462,MUSLIM,03224516687,3.234547e+09,MALE,ENGLISH,SITARA COLONY # 2 C A S LAHORE,FEE PAYING
1,F6508,2022-08-18,2379,2,SHABRAIZ,MUHAMMAD NAWAZ,2019-07-11,AWAN,PLAY GROUP,JINNAH,35201-3924383-7,NaN,F6508,MUSLIM,03216189735,3.216568e+09,MALE,ENGLISH,MUHALA SITARA COLONY # 2 PIND BANDIAWALA C A S...,FEE PAYING
2,F6539,2022-09-20,1810,3,ALI HASSAN,MUHAMMAD ASIF ALI,2018-06-29,MALIK,PLAY GROUP,JINNAH,35201-2896840-9,NaN,F6539,MUSLIM,03214857605,3.214858e+09,MALE,ENGLISH,SITTARA COLONY #2 HASHMI ST C A S LAHORE,50% DISCOUNT
3,F6542,2022-09-26,2398,4,MUHAMMAD HAROON,QAMAR IQBAL,2017-07-08,NaN,PLAY GROUP,JINNAH,35201-5240504-5,NaN,F6542,MUSLIM,03234576092,3.044801e+09,MALE,ENGLISH,SITARA COLONY # 2 MUGHAL STREET C A S LAHORE,FEE PAYING
4,F6543,2022-09-26,2398,5,AROOJ FATIMA,QAMAR IQBAL,1900-01-01,MUGHAL,PLAY GROUP,JINNAH,35201-5240404-5,NaN,F6543,MUSLIM,03234576092,3.044801e+09,FEMALE,ENGLISH,SITARA COLONY # 2 MUGHAL STREET C A S LAHORE,FEE PAYING

In [4]:
students_data.shape

(1633, 20)

### Second Table

In [5]:
girls_branch = pd.read_excel('datasets/girlsbranchunpaid-cleaned.xlsx')
girls_branch.head()

,Sr. #,FamilyNo,Unnamed: 2,Total Family Balance,StudentName,Father Name Mobile #,Total Student Balance,Last Paid Date,Unnamed: 8,Remarks
0,1,1072,(3),0,SARIA HUSNAIN,MUHAMMAD HUSNAIN\n03016762316 03224084491,400,2023-06-12 00:00:00,-1400.0,NaN
1,2,800,(4),4500,ADEESHA NOOR,SHOUKAT ALI\n03026033262,1700,2023-06-12 00:00:00,-2500.0,NaN
2,3,1231,(3),2500,JASHFA,ALI ASGHAR\n03064730813 03054130399,1700,2023-06-08 00:00:00,-533.0,NaN
3,4,1308,(2),12660,SANIA,JAVED\n03062997511,6800,2023-05-22 00:00:00,-5000.0,NaN
4,5,2122,(4),5700,MINAHIL SHABBIR,MUHAMMAD SHABBIR\n03234800581 03013116511,1700,2023-05-15 00:00:00,-1925.0,NaN

### Cleaning the Dataset

In [6]:
lst = []
for girls_family_no in girls_branch['FamilyNo']:
    l = ''
    for letter in str(girls_family_no):
        if '(' in letter:
            break
        l += letter
    lst.append(l)
result = np.array(lst).astype('int')

In [7]:
girls_branch.loc[:, 'FamilyNo'] = result

C:\Users\PC\AppData\Local\Temp\ipykernel_21292\336998636.py:1: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  girls_branch.loc[:, 'FamilyNo'] = result

In [8]:
girls_branch.shape

(136, 10)

In [9]:
girls_branch['Total Student Balance'].isna().sum()

0

### Third Table

In [10]:
boys_branch = pd.read_excel('datasets/boysbranchunpaid-cleaned.xlsx', header=[1])
boys_branch.head()

,Sr. #,FamilyNo,Unnamed: 2,Total Family Balance,StudentName,Father Name Mobile #,Total Student Balance,Last Paid Date,Unnamed: 8,Remarks
0,1,1810,(3),14600.0,ALI HASSAN,MUHAMMAD ASIF ALI\n03214857605 03214857605,2600,2023-03-22 00:00:00,-15000.0,NaN
1,2,2402,(1),3300.0,URWA AMIR,MUHAMMAD AMIR\n03064736605 03219499458,3300,2023-05-11 00:00:00,-1500.0,NaN
2,3,2405,(1),1600.0,ABDULLAH,SABIR ALI\n03084840528,1600,2023-05-16 00:00:00,-1600.0,NaN
3,4,2067,(2),3200.0,ANAM,MUHAMMAD NAVEED\n03220742059 03214174285,1600,2023-05-02 00:00:00,-3200.0,NaN
4,5,2312,(2),3200.0,NOOR HARAM,KHALIL AHMAD\n03244582182 03018172716,1600,2023-05-15 00:00:00,-3200.0,NaN

### Cleaning the Dataset

In [11]:
lst = []
for boys_family_no in boys_branch['FamilyNo']:
    l = ''
    for letter in str(boys_family_no):
        if '(' in letter:
            break
        l += letter
    lst.append(l)
result = np.array(lst).astype('int')

In [12]:
boys_branch.loc[:, 'FamilyNo'] = result

C:\Users\PC\AppData\Local\Temp\ipykernel_21292\3176391470.py:1: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  boys_branch.loc[:, 'FamilyNo'] = result

In [13]:
boys_branch.shape

(631, 10)

In [14]:
boys_branch['Total Student Balance'].isna().sum()

0

### Merged Students and Girls Table

In [15]:
students_and_girls_data = pd.merge(left=students_data, right=girls_branch, how='left', on=['FamilyNo', 'StudentName'])
students_and_girls_data[~students_and_girls_data['Total Student Balance'].isna()].shape

(136, 28)

In [16]:
columns = ['RegNo', 'DOAd', 'FamilyNo', 'RollNo', 'StudentName', 'FatherName',
       'DOB', 'Cast', 'ClassName', 'SecName', 'FCNIC', 'BForm', 'AddFormNo',
       'Religion', 'FatherNo', 'MotherNo', 'Gender', 'Medium', 'Address',
       'FeeType', 'Total Student Balance']
students_and_girls_data = students_and_girls_data[columns]
students_and_girls_data.head()

,RegNo,DOAd,FamilyNo,RollNo,StudentName,FatherName,DOB,Cast,ClassName,SecName,...,BForm,AddFormNo,Religion,FatherNo,MotherNo,Gender,Medium,Address,FeeType,Total Student Balance
0,F6462,2022-07-27,2351,1,MUHAMMAD UMER,TOUQEER AHMAD,2020-03-10,MUGHAL,PLAY GROUP,JINNAH,...,NaN,F6462,MUSLIM,03224516687,3.234547e+09,MALE,ENGLISH,SITARA COLONY # 2 C A S LAHORE,FEE PAYING,NaN
1,F6508,2022-08-18,2379,2,SHABRAIZ,MUHAMMAD NAWAZ,2019-07-11,AWAN,PLAY GROUP,JINNAH,...,NaN,F6508,MUSLIM,03216189735,3.216568e+09,MALE,ENGLISH,MUHALA SITARA COLONY # 2 PIND BANDIAWALA C A S...,FEE PAYING,NaN
2,F6539,2022-09-20,1810,3,ALI HASSAN,MUHAMMAD ASIF ALI,2018-06-29,MALIK,PLAY GROUP,JINNAH,...,NaN,F6539,MUSLIM,03214857605,3.214858e+09,MALE,ENGLISH,SITTARA COLONY #2 HASHMI ST C A S LAHORE,50% DISCOUNT,NaN
3,F6542,2022-09-26,2398,4,MUHAMMAD HAROON,QAMAR IQBAL,2017-07-08,NaN,PLAY GROUP,JINNAH,...,NaN,F6542,MUSLIM,03234576092,3.044801e+09,MALE,ENGLISH,SITARA COLONY # 2 MUGHAL STREET C A S LAHORE,FEE PAYING,NaN
4,F6543,2022-09-26,2398,5,AROOJ FATIMA,QAMAR IQBAL,1900-01-01,MUGHAL,PLAY GROUP,JINNAH,...,NaN,F6543,MUSLIM,03234576092,3.044801e+09,FEMALE,ENGLISH,SITARA COLONY # 2 MUGHAL STREET C A S LAHORE,FEE PAYING,NaN

### Missing Girls Data

In [17]:
family_no =  students_and_girls_data[~students_and_girls_data['Total Student Balance'].isna()]['FamilyNo']
student_name =  students_and_girls_data[~students_and_girls_data['Total Student Balance'].isna()]['StudentName']
condition = girls_branch['FamilyNo'].isin(family_no) \
              & girls_branch['StudentName'].isin(student_name)
missing_girls = girls_branch[~condition]
missing_girls

Empty DataFrame
Columns: [Sr. #, FamilyNo, Unnamed: 2, Total Family Balance, StudentName, Father Name Mobile #, Total Student Balance, Last Paid Date, Unnamed: 8, Remarks]
Index: []

### Merge Students and Girls Table with Boys Table

In [18]:
students_boys_and_girls_data = pd.merge(left=students_and_girls_data, right=boys_branch, how='left', on=['FamilyNo', 'StudentName'], suffixes=('', '_b'))
students_boys_and_girls_data[~students_boys_and_girls_data['Total Student Balance_b'].isna()].shape

(595, 29)

In [19]:
students_boys_and_girls_data.columns

Index(['RegNo', 'DOAd', 'FamilyNo', 'RollNo', 'StudentName', 'FatherName',
       'DOB', 'Cast', 'ClassName', 'SecName', 'FCNIC', 'BForm', 'AddFormNo',
       'Religion', 'FatherNo', 'MotherNo', 'Gender', 'Medium', 'Address',
       'FeeType', 'Total Student Balance', 'Sr. #', 'Unnamed: 2',
       'Total Family Balance', 'Father Name Mobile #',
       'Total Student Balance_b', 'Last Paid Date', 'Unnamed: 8', 'Remarks'],
      dtype='object')

In [20]:
columns = ['RegNo', 'DOAd', 'FamilyNo', 'RollNo', 'StudentName', 'FatherName',
       'DOB', 'Cast', 'ClassName', 'SecName', 'FCNIC', 'BForm', 'AddFormNo',
       'Religion', 'FatherNo', 'MotherNo', 'Gender', 'Medium', 'Address',
       'FeeType', 'Total Student Balance', 'Total Student Balance_b']
students_boys_and_girls_data = students_boys_and_girls_data[columns]
students_boys_and_girls_data.head()

,RegNo,DOAd,FamilyNo,RollNo,StudentName,FatherName,DOB,Cast,ClassName,SecName,...,AddFormNo,Religion,FatherNo,MotherNo,Gender,Medium,Address,FeeType,Total Student Balance,Total Student Balance_b
0,F6462,2022-07-27,2351,1,MUHAMMAD UMER,TOUQEER AHMAD,2020-03-10,MUGHAL,PLAY GROUP,JINNAH,...,F6462,MUSLIM,03224516687,3.234547e+09,MALE,ENGLISH,SITARA COLONY # 2 C A S LAHORE,FEE PAYING,NaN,NaN
1,F6508,2022-08-18,2379,2,SHABRAIZ,MUHAMMAD NAWAZ,2019-07-11,AWAN,PLAY GROUP,JINNAH,...,F6508,MUSLIM,03216189735,3.216568e+09,MALE,ENGLISH,MUHALA SITARA COLONY # 2 PIND BANDIAWALA C A S...,FEE PAYING,NaN,NaN
2,F6539,2022-09-20,1810,3,ALI HASSAN,MUHAMMAD ASIF ALI,2018-06-29,MALIK,PLAY GROUP,JINNAH,...,F6539,MUSLIM,03214857605,3.214858e+09,MALE,ENGLISH,SITTARA COLONY #2 HASHMI ST C A S LAHORE,50% DISCOUNT,NaN,2600.0
3,F6542,2022-09-26,2398,4,MUHAMMAD HAROON,QAMAR IQBAL,2017-07-08,NaN,PLAY GROUP,JINNAH,...,F6542,MUSLIM,03234576092,3.044801e+09,MALE,ENGLISH,SITARA COLONY # 2 MUGHAL STREET C A S LAHORE,FEE PAYING,NaN,NaN
4,F6543,2022-09-26,2398,5,AROOJ FATIMA,QAMAR IQBAL,1900-01-01,MUGHAL,PLAY GROUP,JINNAH,...,F6543,MUSLIM,03234576092,3.044801e+09,FEMALE,ENGLISH,SITARA COLONY # 2 MUGHAL STREET C A S LAHORE,FEE PAYING,NaN,NaN

### Missing Boys Data

In [21]:
family_no =  students_boys_and_girls_data[~students_boys_and_girls_data['Total Student Balance_b'].isna()]['FamilyNo']
student_name =  students_boys_and_girls_data[~students_boys_and_girls_data['Total Student Balance_b'].isna()]['StudentName']
condition = boys_branch['FamilyNo'].isin(family_no) \
              & boys_branch['StudentName'].isin(student_name)
missing_boys = boys_branch[~condition]
missing_boys.shape

(36, 10)

In [22]:
missing_boys.to_excel('./result/Missing Boys Data.xlsx', index=False)

In [23]:
students_boys_and_girls_data.shape

(1633, 22)

In [24]:
for con1, con2 in zip(students_boys_and_girls_data['Total Student Balance'], students_boys_and_girls_data['Total Student Balance_b']):
    if str(con1) != 'nan' and str(con2) != 'nan':
        print('Wrong', con1, con2)

In [25]:
students_boys_and_girls_data['Merged Balance'] = students_boys_and_girls_data['Total Student Balance'] \
  .combine_first(students_boys_and_girls_data['Total Student Balance_b'])
students_boys_and_girls_data = students_boys_and_girls_data.drop(columns=['Total Student Balance', 'Total Student Balance_b'])
students_boys_and_girls_data['Total Student Balance'] = students_boys_and_girls_data['Merged Balance']
students_boys_and_girls_data = students_boys_and_girls_data.drop(columns='Merged Balance')
students_boys_and_girls_data.columns

Index(['RegNo', 'DOAd', 'FamilyNo', 'RollNo', 'StudentName', 'FatherName',
       'DOB', 'Cast', 'ClassName', 'SecName', 'FCNIC', 'BForm', 'AddFormNo',
       'Religion', 'FatherNo', 'MotherNo', 'Gender', 'Medium', 'Address',
       'FeeType', 'Total Student Balance'],
      dtype='object')

In [26]:
students_boys_and_girls_data.to_excel('./result/Student Data.xlsx', index=False)

In [31]:
students_boys_and_girls_data['Total Student Balance'].describe()

count      731.000000
mean      2865.690834
std       2298.275687
min         50.000000
25%       1600.000000
50%       2000.000000
75%       3465.000000
max      20100.000000
Name: Total Student Balance, dtype: float64